# 📁 فایل: bot/config.py

# 🔐 توکن ربات Bale
TOKEN = "1010361809:u9favCTJqt5zgmHkMAhO2sBJYqMUcsMkCCiycx1D"

# 👑 آیدی عددی مالک ربات
OWNER_ID = 508276871

# 📦 آیدی عددی کانال فرم سفارشات
ORDER_CHANNEL_ID = -1005052351265  # دقت کن: همیشه با -100 شروع میشه

# 💰 آیدی عددی کانال افزایش موجودی
BALANCE_CHANNEL_ID = -1005871189664

# 🧑‍💼 لیست پشتیبان‌ها (می‌تونه آیدی عددی یا یوزرنیم با @ باشه)
SUPPORT_IDS = ["@CyrusParsy"]

# 💵 محدودیت‌های افزایش موجودی (به تومان)
MIN_CHARGE = 1000       # حداقل مبلغ
MAX_CHARGE = 500000     # حداکثر مبلغ

# 🔧 لیست ادمین‌ها (علاوه بر OWNER، آیدی عددی یا یوزرنیم)
ADMINS = [508276871, "@CyrusParsy"]
