# فایل: bot/config.py

# 🔐 توکن ربات
TOKEN = "1010361809:u9favCTJqt5zgmHkMAhO2sBJYqMUcsMkCCiycx1D"

# 👑 آیدی عددی مالک اصلی ربات
OWNER_ID = 508276871

# 📦 آیدی عددی کانال فرم سفارشات
ORDER_CHANNEL_ID = -1005052351265  # دقت کن که با -100 شروع شده

# 💰 آیدی عددی کانال افزایش موجودی
BALANCE_CHANNEL_ID = -1005871189664

# 🛠 لیست پشتیبان‌ها (میتونه یوزرنیم با @ یا عددی باشه)
SUPPORT_IDS = ["@CyrusParsy"]

# 💸 محدودیت مبلغ افزایش موجودی
MIN_CHARGE = 1000     # حداقل افزایش موجودی (تومان)
MAX_CHARGE = 500000   # حداکثر افزایش موجودی (تومان)

# 🛡 لیست ادمین‌ها (اگر خواستی غیر از OWNER هم داشته باشی)
ADMINS = [508276871, "@CyrusParsy"]
